code/openfoam/tutorials/multiRegion/CHT/coolingCylinder2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication splitMeshRegions -cellZones all

runApplication foamMultiRun

#------------------------------------------------------------------------------
